In [25]:
import pandas as pd

---

`.melt()` creates two columns with all the variable names and all the values.

From **wide** to **long** format.

In [21]:
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [24]:
df.melt(['height'], # <-- the first argument fixes a column and uses it as identifier for the new column `values`
        var_name='var1',
       value_name='val1')

   height    var1  val1
0     192  weight    82
1     175  weight    70
2      20  weight     7
3     192     age    23
4     175     age    20
5      20     age    14

## References
1. `pandas` cheatsheet https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf